
&НаКлиенте
Перем ИмяОшибки, ЗагаданноеСлово, МассивСловДляВыбора, МассивИзЗагаданногоСлова, МассивИзЗагаданногоСловаХ, МассивВведенныхБукв
	, ДлинаЗагаданногоСлова, ДатаСтарт, ДатаДок;

&НаКлиенте
Процедура ВывестиМассивБукв(Команда)
	
	ОчиститьСообщения();
	
	ВремСлово = "   ";
	ВремСловоХ = "   ";
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		ВремСлово = ВремСлово + ВРег(МассивИзЗагаданногоСлова.Получить(Сч)) + "        ";
		ВремСловоХ = ВремСловоХ + ВРег(МассивИзЗагаданногоСловаХ.Получить(Сч)) + "   ";
	КонецЦикла;
	
	Сообщить(ВремСлово);
	Сообщить(ВремСловоХ);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ОчиститьСообщения();
	Если ПарсингВвод(1) Тогда
		Если СтрДлина(ВведитеСловоИлиБукву) = 1 Тогда
			ПроверкаБуквы(НРег(ВведитеСловоИлиБукву));
		Иначе 
			ПроверкаСлова(НРег(ВведитеСловоИлиБукву));
		КонецЕсли;		
	Иначе
		Сообщить("Туууут ошибочка.... " + ИмяОшибки);
	КонецЕсли;
	ВведитеСловоИлиБукву = "";
		
КонецПроцедуры

&НаКлиенте
Функция ПарсингВвод(Ключ) // Ключ для проверки откуда берутся слова - из списка в программе или из файла
	
	Если Ключ = 1 Тогда 
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ВведитеСловоИлиБукву;
	КонецЕсли;
	
	Если СтрДлина(ВведитеСловоИлиБукву) = 0 Тогда
		ИмяОшибки = "Пустая Строка";
		Возврат Ложь;
	ИначеЕсли СтрДлина(ВведитеСловоИлиБукву) = 1 Тогда 
		Если ПроверкаНаЧислоИСимволы(ВведитеСловоИлиБукву) Тогда
			Возврат Ложь;
		Иначе 
			Возврат Истина;
		КонецЕсли;		
	ИначеЕсли СтрДлина(ВведитеСловоИлиБукву) > 1 Тогда
		Если ПроверкаНаЧислоИСимволы(ВведитеСловоИлиБукву) Тогда
			ИмяОшибки = "тут были числа или символы";
			Возврат Ложь;
		Иначе 
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция  ПроверкаНаЧислоИСимволы(ВведитеСловоИлиБукву)

	Если ПроверкаНаЧисло(ВведитеСловоИлиБукву) Тогда
		ИмяОшибки = "Это не буква а число";
		Возврат Истина;
	ИначеЕсли ПроверкаНаСимвол(ВведитеСловоИлиБукву) Тогда
		ИмяОшибки = "Это не буква а символ";
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

&НаКлиенте
Функция  ПроверкаНаЧисло(ВведитеСловоИлиБукву)
	
	ДлинаДо = СтрДлина(ВведитеСловоИлиБукву);
	
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"1","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"2","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"3","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"4","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"5","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"6","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"7","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"8","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"9","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"0","");
	
	Если НЕ ДлинаДо = СтрДлина(ВведитеСловоИлиБукву) Тогда //строка содержала цифру
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция  ПроверкаНаСимвол(ВведитеСловоИлиБукву)
	
	ДлинаДо = СтрДлина(ВведитеСловоИлиБукву);
	
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,".","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,",","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"?","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"\","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"/","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"|","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"[","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"]","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"{","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"}","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"(","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,")","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"*","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"-","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"+","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"<","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,">","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,":","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"%","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,";","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"№","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"'","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"!","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"~","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"`","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"#","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"$","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"^","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"&","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"@","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"""","");
	ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву," ","");
	
	Если НЕ ДлинаДо = СтрДлина(ВведитеСловоИлиБукву) Тогда //строка содержала символ
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИнициализацияМассива(1); // Просто передан тип (Число) для нужной инициализации массива
	ЗагадатьСлово();
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ВведитеСловоИлиБукву;	
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияМассива(Массив)
	
    МассивСловДляВыбора = Новый Массив();
	
	Если ТипЗнч(Массив) = Тип("Массив") Тогда 
		Для Каждого Эл Из Массив Цикл
			МассивСловДляВыбора.Добавить(Эл);
		КонецЦикла;
	Иначе 
		МассивСловДляВыбора.Добавить("Оператор");
		МассивСловДляВыбора.Добавить("Программа");
		МассивСловДляВыбора.Добавить("Продажи");
		МассивСловДляВыбора.Добавить("Закупки");
		МассивСловДляВыбора.Добавить("Склады");
		МассивСловДляВыбора.Добавить("Юзер");	
		// добавить слова при необходимости
	КонецЕсли;
	
	ТэмпСлово = "";
	Для Каждого Эл Из МассивСловДляВыбора Цикл
		ТэмпСлово = ТэмпСлово + "  " + Эл;
	КонецЦикла;
	
	//// аналог чита
	//Сообщить("Массив слов для выбора");
	//Сообщить(ТэмпСлово);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагадатьСлово()
	
	// генерируем новое слово 
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Индекс = ГСЧ.СлучайноеЧисло(0, МассивСловДляВыбора.Количество() - 1);
	
	// чекаем слово
	ЗагаданноеСлово = НРег(МассивСловДляВыбора.Получить(Индекс));
	ДлинаЗагаданногоСлова = СтрДлина(ЗагаданноеСлово);
	ЭтаФорма.ЗагадалиНовоеСлово = "СОСТОЯЩЕЕ ИЗ " + СтрДлина(ЗагаданноеСлово) + " БУКВ";
	
	МассивВведенныхБукв = Новый Массив();	
	РазобратьПоБуквам();
	ПрорисоватьБуквы();
	
	ДатаСтарт = Формат(ТекущаяДата(), "ДЛФ=T");
		
КонецПроцедуры

&НаКлиенте
Процедура РазобратьПоБуквам()
	
	МассивИзЗагаданногоСлова = Новый Массив();
	МассивИзЗагаданногоСловаХ = Новый Массив();
	
	Для Сч = 1 По СтрДлина(ЗагаданноеСлово) Цикл
		БукваПерем = Сред(ЗагаданноеСлово, Сч, 1);
		МассивИзЗагаданногоСлова.Добавить(БукваПерем);
		МассивИзЗагаданногоСловаХ.Добавить(Ложь);		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаБуквы(ВведитеСловоИлиБукву)
	
	Если МассивВведенныхБукв.Найти(ВведитеСловоИлиБукву) = Неопределено Тогда 
		МассивВведенныхБукв.Добавить(ВведитеСловоИлиБукву);
	КонецЕсли;
	
	ПеремДляВернаяБуква = 0;
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСлова.Получить(Сч) = ВведитеСловоИлиБукву Тогда
			
			РезПроверки = ПроверкаОткрытойБуквы(ВведитеСловоИлиБукву);
			
			Если РезПроверки = 2 Тогда
				Сообщить("Эта буква уже угадана.");
			ИначеЕсли РезПроверки = 1 Тогда
				Сообщить("Вы угадали букву!");
				ИзменитьБуквы(ВведитеСловоИлиБукву);
				ПроверкаОтгаданногоСловаПоБуквам();
			КонецЕсли;
			
			ПеремДляВернаяБуква = 1;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	 
	Если ПеремДляВернаяБуква = 0 Тогда 
		Сообщить("Буква неверная ");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСлова(ВведитеСловоИлиБукву)
	
	Если ВведитеСловоИлиБукву = ЗагаданноеСлово Тогда 
		Сообщить("Ура. Вы угадали слово!");
		
		ДатаДок = Формат(ТекущаяДата(), "ДЛФ=T");
		
		//ЗаписьВРегистрСведений(ЗагаданноеСлово, ДатаСтарт, ДатаДок);
		ЗагадатьСлово();
		ВведитеСловоИлиБукву = "";
	Иначе
		Сообщить("Слово неверное ");
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ВведитеСловоИлиБукву;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОтгаданногоСловаПоБуквам()
	
	Если МассивИзЗагаданногоСловаХ.Найти(Ложь) = Неопределено Тогда
		Сообщить("Все буквы отгаданы!");
		ЗагадатьСлово();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрорисоватьБуквы()
	
	ВремСлово = "   ";
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСловаХ.Получить(Сч) = Ложь Тогда
			ВремСлово = ВремСлово + "[//]   ";
		Иначе 
			ВремСлово = ВремСлово + ВРег(МассивИзЗагаданногоСлова.Получить(Сч)) + "   ";
		КонецЕсли;		
	КонецЦикла;
	
	БуквыИзСлова = ВремСлово;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаОткрытойБуквы(ОтгаданнаяБуква)
	
	// буква уже отгадана
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСлова.Получить(Сч) = ОтгаданнаяБуква Тогда
			Если МассивИзЗагаданногоСловаХ.Получить(Сч) = Истина Тогда 
				Возврат 2; // буква уже была отгадана
				Прервать;
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;
	
	// буква только что отгадана
	Возврат 1;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьБуквы(ОтгаданнаяБуква)
	
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСлова.Получить(Сч) = ОтгаданнаяБуква Тогда 
			МассивИзЗагаданногоСловаХ.Установить(Сч, Истина);
		КонецЕсли;
	КонецЦикла; 
	
	ПрорисоватьБуквы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВведенныеБуквы(Команда)
	
	ОчиститьСообщения();
	ТэмпСлово = "";
	
	Для Каждого Эл Из МассивВведенныхБукв Цикл 
		ТэмпСлово = ТэмпСлово + ВРег(Эл) + "  ";	
	КонецЦикла;
	
	Сообщить(ТэмпСлово);  
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаписьВРегистрСведений(ЗагаданноеСлово, ДатаСтарт, ДатаДок)
//	
//	//ГенераторСЧ = Новый ГенераторСлучайныхЧисел();
//	//СлучЧисло = ГенераторСЧ.СлучайноеЧисло(0, 10);
//		
//	НовДок = Документы.ОтгаданноеСлово.СоздатьДокумент();
//	НовДок.Слово = "Слово - """ + ВРег(ЗагаданноеСлово) + """  =>  " + "ЗАГАДАНО в: " + ДатаДок + "  =>  " + " РАЗГАДАНО в: " + ДатаСтарт;
//	
//	НовДок.Дата = ТекущаяДата();
//	НовДок.Записать(РежимЗаписиДокумента.Проведение); 
//    
//КонецПроцедуры  

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.Каталог = "C:\";
	Диалог.Фильтр = "Текстовый документ (*.txt)|*.txt|"
		 + "Таблица CSV (*.csv)|*.csv|";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
		
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложениеАсинх(ПутьКФайлу, "C:\");
	
 КонецПроцедуры 
 
&НаКлиенте
Процедура ЗагрузитьСлова(Команда)

	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда 
		Сообщить("Расширение файла - " + Файл.Расширение);
		Если Файл.Расширение = ".txt" Тогда 
			Открыть_txt();
		ИначеЕсли Файл.Расширение = ".csv" Тогда 
			Открыть_csv();
		КонецЕсли;
	Иначе
		Сообщить("Файла по указанному пути не существует");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Открыть_txt()
	
	Содержимое = Новый ТекстовыйДокумент;
	Содержимое.Прочитать(ПутьКФайлу);
	МассивВсехПолученныхСлов = Новый Массив;
	 
	Для НомерСтроки = 1 По Содержимое.КоличествоСтрок()  Цикл
		ТекСтрока = Содержимое.ПолучитьСтроку(НомерСтроки);
		 
		МассивСлов = СтрРазделить(ТекСтрока, ";");
		
		Если МассивСлов.Количество() > 0 Тогда // Проверяем то что слова были в файле
			Для Каждого Эл Из МассивСлов Цикл 
				Если НЕ ПроверкаНаЧисло(Эл) И НЕ ПроверкаНаСимвол(Эл) Тогда // Проверяем на то что это чистые слова
					МассивВсехПолученныхСлов.Добавить(Эл);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если массив не пустой то передаем его для инициализации
	Если МассивВсехПолученныхСлов.Количество() > 0 Тогда 
		ИнициализацияМассива(МассивВсехПолученныхСлов);
		ЗагадатьСлово();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Открыть_csv()
	Открыть_txt();
КонецПроцедуры






