
&НаКлиенте
Перем ИмяОшибки, ЗагаданноеСлово, МассивСловДляВыбора, МассивИзЗагаданногоСлова, МассивИзЗагаданногоСловаХ, МассивВведенныхБукв
	, ДлинаЗагаданногоСлова;

&НаКлиенте
Процедура ВывестиМассивБукв(Команда)
	
	ОчиститьСообщения();
	
	ВремСлово = "   ";
	ВремСловоХ = "   ";
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		ВремСлово = ВремСлово + ВРег(МассивИзЗагаданногоСлова.Получить(Сч)) + "        ";
		ВремСловоХ = ВремСловоХ + ВРег(МассивИзЗагаданногоСловаХ.Получить(Сч)) + "   ";
	КонецЦикла;
	
	Сообщить(ВремСлово);
	Сообщить(ВремСловоХ);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ОчиститьСообщения();
	Если ПарсингВвод(ВведитеСловоИлиБукву) Тогда
		Если СтрДлина(ВведитеСловоИлиБукву) = 1 Тогда
			//МассивВведенныхБукв.Добавить(ВведитеСловоИлиБукву);
			ПроверкаБуквы(НРег(ВведитеСловоИлиБукву));
		Иначе 
			ПроверкаСлова(НРег(ВведитеСловоИлиБукву));
		КонецЕсли;		
	Иначе
		Сообщить("Туууут ошибочка.... " + ИмяОшибки);
	КонецЕсли;
	ВведитеСловоИлиБукву = "";
		
КонецПроцедуры

&НаКлиенте
Функция ПарсингВвод(ВведитеСловоИлиБукву)

	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ВведитеСловоИлиБукву;
	
	Если СтрДлина(ВведитеСловоИлиБукву) = 0 Тогда
		ИмяОшибки = "Пустая Строка";
		Возврат Ложь;
	ИначеЕсли СтрДлина(ВведитеСловоИлиБукву) = 1 Тогда
		Попытка
			Буква = Число(ВведитеСловоИлиБукву);
		Исключение
			Буква = ВведитеСловоИлиБукву;
			Сообщить("Буква - " + ВРег(Буква));
			Возврат Истина;
		КонецПопытки;
			ИмяОшибки = "Это не буква а число";
			Возврат Ложь;
	ИначеЕсли СтрДлина(ВведитеСловоИлиБукву) > 1 Тогда

			ДлинаОдин = СтрДлина(ВведитеСловоИлиБукву);	
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"1","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"2","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"3","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"4","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"5","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"6","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"7","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"8","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"9","");
			ВведитеСловоИлиБукву = СтрЗаменить(ВведитеСловоИлиБукву,"0","");
			
			Если ВведитеСловоИлиБукву = "" Тогда // строка пустая, были все цифры
				ИмяОшибки = "тут были только числа";
				Возврат Ложь;
			ИначеЕсли НЕ ДлинаОдин = СтрДлина(ВведитеСловоИлиБукву) Тогда //строка не пустая но были цифры
				ИмяОшибки = "тут были числа вместе с символами";
				Возврат Ложь;
			Иначе
				Возврат Истина;
			КонецЕсли;
			
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИнициализацияМассива();
	ЗагадатьСлово();
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияМассива()
	
    МассивСловДляВыбора = Новый Массив();
	МассивСловДляВыбора.Добавить("Оператор");
	МассивСловДляВыбора.Добавить("Программа");
	МассивСловДляВыбора.Добавить("Продажи");
	МассивСловДляВыбора.Добавить("Закупки");
	МассивСловДляВыбора.Добавить("Склады");
	МассивСловДляВыбора.Добавить("Юзер");	
	// добавить слова при необходимости
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагадатьСлово()
	
	// генерируем новое слово 
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Индекс = ГСЧ.СлучайноеЧисло(0, МассивСловДляВыбора.Количество() - 1);
	//Сообщить("индекс "+ Индекс);
	
	//чекаем слово
	ЗагаданноеСлово = НРег(МассивСловДляВыбора.Получить(Индекс));
	//Сообщить("слово " + ЗагаданноеСлово);
	ДлинаЗагаданногоСлова = СтрДлина(ЗагаданноеСлово);
	ЭтаФорма.ЗагадалиНовоеСлово = "СОСТОЯЩЕЕ ИЗ " + СтрДлина(ЗагаданноеСлово) + " БУКВ";
	
	МассивВведенныхБукв = Новый Массив();	
	РазобратьПоБуквам();
	ПрорисоватьБуквы();
		
КонецПроцедуры

&НаКлиенте
Процедура РазобратьПоБуквам()
	
	МассивИзЗагаданногоСлова = Новый Массив();
	МассивИзЗагаданногоСловаХ = Новый Массив();
	
	Для Сч = 1 По СтрДлина(ЗагаданноеСлово) Цикл
		БукваПерем = Сред(ЗагаданноеСлово, Сч, 1);
		МассивИзЗагаданногоСлова.Добавить(БукваПерем);
		МассивИзЗагаданногоСловаХ.Добавить(Ложь);		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаБуквы(ВведитеСловоИлиБукву)
	
	Если МассивВведенныхБукв.Найти(ВведитеСловоИлиБукву) = Неопределено Тогда 
		МассивВведенныхБукв.Добавить(ВведитеСловоИлиБукву);
	КонецЕсли;
	
	ПеремДляВернаяБуква = 0;
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСлова.Получить(Сч) = ВведитеСловоИлиБукву Тогда
			
			РезПроверки = ПроверкаОткрытойБуквы(ВведитеСловоИлиБукву);
			
			Если РезПроверки = 2 Тогда
				Сообщить("Эта буква уже угадана.");
			ИначеЕсли РезПроверки = 1 Тогда
				Сообщить("Вы угадали букву!");
				ИзменитьБуквы(ВведитеСловоИлиБукву);
			КонецЕсли;
			
			ПеремДляВернаяБуква = 1;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	 
	Если ПеремДляВернаяБуква = 0 Тогда 
		Сообщить("Буква неверная ");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСлова(ВведитеСловоИлиБукву)
	
	Если ВведитеСловоИлиБукву = ЗагаданноеСлово Тогда 
		Сообщить("Ура. Вы угадали слово!");
		ЗагадатьСлово();
		ВведитеСловоИлиБукву = "";
	Иначе
		Сообщить("Слово неверное ");
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ВведитеСловоИлиБукву;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрорисоватьБуквы()
	
	ВремСлово = "   ";
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСловаХ.Получить(Сч) = Ложь Тогда
			ВремСлово = ВремСлово + "[//]   ";
		Иначе 
			ВремСлово = ВремСлово + ВРег(МассивИзЗагаданногоСлова.Получить(Сч)) + "   ";
		КонецЕсли;		
	КонецЦикла;
	
	БуквыИзСлова = ВремСлово;
	//Сообщить(БуквыИзСлова);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаОткрытойБуквы(ОтгаданнаяБуква)
	
	// буква уже отгадана
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСлова.Получить(Сч) = ОтгаданнаяБуква Тогда
			Если МассивИзЗагаданногоСловаХ.Получить(Сч) = Истина Тогда 
				Возврат 2; // буква уже была отгадана
				Прервать;
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;
	
	// буква только отгадана
	Возврат 1;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьБуквы(ОтгаданнаяБуква)
	
	Для Сч = 0 По МассивИзЗагаданногоСлова.Количество() - 1 Цикл
		Если МассивИзЗагаданногоСлова.Получить(Сч) = ОтгаданнаяБуква Тогда 
			МассивИзЗагаданногоСловаХ.Установить(Сч, Истина);
		КонецЕсли;
	КонецЦикла; 
	
	ПрорисоватьБуквы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВведенныеБуквы(Команда)
	
	ОчиститьСообщения();
	ТэмпСлово = "";
	
	Для Каждого Эл Из МассивВведенныхБукв Цикл 
		ТэмпСлово = ТэмпСлово + ВРег(Эл) + "  ";	
	КонецЦикла;
	
	Сообщить(ТэмпСлово);

КонецПроцедуры






