
&НаКлиенте
Процедура ТестМассив() Экспорт
	
	//Инициализация
	Массив = Новый Массив;	
	Массив.Добавить("Первый");
	Массив.Добавить(2);
	Массив.Добавить(3);
	Массив.Вставить(3, "Четвертый");
	Массив.Вставить(4, "Пятый");
	
	//Доступ по Элементу
	Сообщить("Второй элемент - " + Массив[1]);
	Сообщить("Третий элемент - " + Массив.Получить(3)); //по индексу
	Сообщить("Четвертый элемент - " + Массив.Найти("Четвертый")); // возвращает инлекс либо НЕОПРЕДЕЛЕНО если нет элемента
	Сообщить("Третий элемент - " + Массив.Найти(3));

	//Количество элементов
	Сообщить("Кол-во эл - " + Массив.Количество() + " шт");
	
	//Удаление элемента
	Массив.Удалить(1); //по индексу
	Сообщить("Кол-во эл - " + Массив.Количество());
	
	//Изменение элемента
	Массив.Вставить(1, "временное");
	Сообщить(Массив[1]);
	Массив[1] = "временное 2";
	Сообщить(Массив[1]);
	Массив.Установить(1, "новое 3");
	Сообщить(Массив[1]);
	
	//Вывод элементов 1
	Для Каждого Эл Из Массив Цикл
		Сообщить(Эл);
	КонецЦикла; 
	
	//Вывод элементов 2
	Для Каждого Эл Из Массив Цикл
		Сообщить(Эл);
	КонецЦикла;
	
КонецПроцедуры

Процедура ТестСтруктура() Экспорт
	
	//Инициализация
	Структура = Новый Структура("Первый, Второй, Третий", "Первый", 2, 3);
	Структура.Вставить("Четвертый", "Четвертый");
	Структура.Вставить("Пятый", 5);
	
	//Доступ по Элементу
	Сообщить("Второй элемент - " + Структура["Второй"]);
	
	//Количество элементов
	Сообщить("Кол-во эл - " + Структура.Количество() + " шт");
	
	//Удаление элемента
	Структура.Удалить("Второй");
	Сообщить("Кол-во эл - " + Структура.Количество()); 
	
	//Изменение элемента
	Структура.Вставить("Третий", "Третий");	
	
	//Вывод элементов
	Для Каждого Эл Из Структура Цикл
		Сообщить(Эл.Ключ + " - " + Эл.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ТестСоответствие() Экспорт
	
	//Инициализация
	Соответствие = Новый Соответствие; // по умолчанию либо через ФиксированноеСоответствие(Конструктор -соответствие)	
	Соответствие.Вставить("Первый", 1);
	Соответствие.Вставить(2, "Второй");
	Соответствие.Вставить(3, "Третий");
	Соответствие.Вставить("Четвертый", 4);
	Соответствие.Вставить(5, "Пятый");
	
	//Доступ по Элементу
	Сообщить("Второй элемент - " + Соответствие[2]);
	Сообщить("Четвертый элемент - " + Соответствие.Получить("Четвертый"));
	
	//Количество элементов
	Сообщить("Кол-во эл - " + Соответствие.Количество() + " шт");
	
	//Удаление элемента
	Соответствие.Удалить(2);
	Сообщить("Кол-во эл - " + Соответствие.Количество()); 
	
	//Добавление элемента
	Соответствие.Вставить(2, "ДВА");
	Соответствие[2] = "Теперь ДВА";
	
	//Вывод элементов
	Для Каждого Эл Из Соответствие Цикл
		Сообщить(" " + Эл.Ключ + " - " + Эл.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗначений() Экспорт
	
	// Доп массив типов
	МасТип = Новый Массив;
	МасТип.Добавить("Строка");
	МасТип.Добавить("Дата");
	
	// Инициализация
	ТабЗнач = Новый ТаблицаЗначений;
	ТабЗнач.Колонки.Добавить("ИмяСотрудника", Новый ОписаниеТипов("Строка")); // Хардкорим Тип
	ТабЗнач.Колонки.Добавить("ФамилияСотрудника"); // Любой тип
	ТабЗнач.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Строка, Дата")); // Хардкорим Разными Типами в Строке
	ТабЗнач.Колонки.Добавить("ДатаРожденияКитайКаленд", Новый ОписаниеТипов(МасТип)); // Хардкорим Разными Типами в Массиве
	
	
	////Найти колонку
	//Сообщить(ТабЗнач.Колонки.Найти("ДатаРождения").Заголовок);
	//Сообщить(ТабЗнач.Колонки.Найти("ДатаРождения").Имя);
	//Сообщить(ТабЗнач.Колонки.Найти("ДатаРождения").ТипЗначения);
	//Сообщить(ТабЗнач.Колонки.Найти("ДатаРождения").Ширина);

	//// Количество колонок
	//Сообщить("Количество колонок = " + ТабЗнач.Колонки.Количество());
	
	// Удаление колонки
	ТабЗнач.Колонки.Удалить("ДатаРожденияКитайКаленд");

	//// Количество колонок
	//Сообщить("Количество колонок = " + ТабЗнач.Колонки.Количество()); 
	
	// Добавить новую строку
	Строка = ТабЗнач.Добавить();
	Строка.ИмяСотрудника = "Иван";
	Строка.ФамилияСотрудника = "Иванов";
	Строка.ДатаРождения = '1980-04-07';
	
	
	// Вывод элементов
	Для Каждого Эл Из ТабЗнач Цикл 
		Сообщить(Эл.ИмяСотрудника + " " + Эл.ФамилияСотрудника + " " + Формат(Эл.ДатаРождения, "ДФ=dd.MM.yyyy")); // "ДЛФ=DD", "ДЛФ=T"		
	КонецЦикла;
	
КонецПроцедуры


